In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["irfan","imran","lucky"],
    "city" : ["pune","chandrapur","nagpur"],
    "age"  : [18,15,13]
}

In [15]:
df=pd.DataFrame([1,2,3],[4,4,5])

In [16]:
df

   0
4  1
4  2
5  3

In [17]:
df.drop([4], axis="rows")

   0
5  3

In [8]:
df.to_csv('pandas1_indexFalse.csv',index=False)

In [9]:
df.head(2)

    name        city  age
0  irfan        pune   18
1  imran  chandrapur   15

In [10]:
df.tail(2)

    name        city  age
1  imran  chandrapur   15
2  lucky      nagpur   13

In [11]:
df.describe()

             age
count   3.000000
mean   15.333333
std     2.516611
min    13.000000
25%    14.000000
50%    15.000000
75%    16.500000
max    18.000000

In [12]:
irfan=pd.read_csv('pandas1.csv')

In [13]:
irfan

   Unnamed: 0   name        city  age
0           0  irfan        pune   18
1           1  imran  chandrapur   15
2           2  lucky      nagpur   13

In [17]:
irfan['age'][1]=14

C:\Users\HP\AppData\Local\Temp\ipykernel_22100\925586482.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  irfan['age'][1]=14

In [18]:
irfan

   Unnamed: 0   name        city  age
0           0  irfan        pune   18
1           1  imran  chandrapur   14
2           2  lucky      nagpur   13

In [19]:
irfan.index=["one","two","three"]

In [20]:
irfan

       Unnamed: 0   name        city  age
one             0  irfan        pune   18
two             1  imran  chandrapur   14
three           2  lucky      nagpur   13

In [24]:
ser=pd.Series(np.random.rand(14))

In [106]:
type(ser)
ser

0     0.977509
1     0.497638
2     0.444900
3     0.349989
4     0.003390
5     0.666291
6     0.114203
7     0.781367
8     0.900623
9     0.090337
10    0.528131
11    0.622735
12    0.385668
13    0.725698
dtype: float64

In [27]:
newdf=pd.DataFrame(np.random.rand(5,5),index=np.arange(5))

In [29]:
newdf.head(2)

          0         1         2         3         4
0  0.331883  0.236231  0.362754  0.744028  0.940179
1  0.424744  0.689684  0.288855  0.879529  0.887812

In [30]:
type(newdf)

pandas.core.frame.DataFrame

In [32]:
newdf.describe()

              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.466303  0.531777  0.493617  0.723307  0.766294
std    0.199326  0.223310  0.397969  0.279214  0.192799
min    0.310880  0.236231  0.007214  0.235050  0.529707
25%    0.331883  0.345464  0.288855  0.744028  0.585261
50%    0.424744  0.689684  0.362754  0.870160  0.887812
75%    0.458715  0.692822  0.902469  0.879529  0.888510
max    0.805291  0.694685  0.906795  0.887768  0.940179

In [33]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
newdf.head()

          0         1         2         3         4
0  0.331883  0.236231  0.362754  0.744028  0.940179
1  0.424744  0.689684  0.288855  0.879529  0.887812
2  0.458715  0.345464  0.007214  0.870160  0.529707
3  0.310880  0.694685  0.902469  0.235050  0.888510
4  0.805291  0.692822  0.906795  0.887768  0.585261

In [36]:
newdf.index

Index([0, 1, 2, 3, 4], dtype='int32')

In [40]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [42]:
a=newdf.to_numpy()

In [45]:
a.dtype

dtype('float64')

In [46]:
a

array([[0.3318833 , 0.23623139, 0.3627541 , 0.74402754, 0.94017852],
       [0.42474399, 0.68968438, 0.2888547 , 0.87952917, 0.88781174],
       [0.45871489, 0.3454636 , 0.00721387, 0.87016032, 0.52970709],
       [0.31088003, 0.69468538, 0.9024693 , 0.2350504 , 0.88850957],
       [0.80529113, 0.69282164, 0.90679451, 0.88776824, 0.58526147]])

In [47]:
newdf.T

          0         1         2         3         4
0  0.331883  0.424744  0.458715  0.310880  0.805291
1  0.236231  0.689684  0.345464  0.694685  0.692822
2  0.362754  0.288855  0.007214  0.902469  0.906795
3  0.744028  0.879529  0.870160  0.235050  0.887768
4  0.940179  0.887812  0.529707  0.888510  0.585261

In [48]:
newdf.head(3)

          0         1         2         3         4
0  0.331883  0.236231  0.362754  0.744028  0.940179
1  0.424744  0.689684  0.288855  0.879529  0.887812
2  0.458715  0.345464  0.007214  0.870160  0.529707

In [51]:
newdf.sort_index(axis=1,ascending=False)

          4         3         2         1         0
0  0.940179  0.744028  0.362754  0.236231  0.331883
1  0.887812  0.879529  0.288855  0.689684  0.424744
2  0.529707  0.870160  0.007214  0.345464  0.458715
3  0.888510  0.235050  0.902469  0.694685  0.310880
4  0.585261  0.887768  0.906795  0.692822  0.805291

In [52]:
newdf.loc[0,0]=321

In [53]:
newdf

            0         1         2         3         4
0  321.000000  0.236231  0.362754  0.744028  0.940179
1    0.424744  0.689684  0.288855  0.879529  0.887812
2    0.458715  0.345464  0.007214  0.870160  0.529707
3    0.310880  0.694685  0.902469  0.235050  0.888510
4    0.805291  0.692822  0.906795  0.887768  0.585261

In [56]:
newdf.columns=list('ABCDE')

In [57]:
newdf

            A         B         C         D         E
0  321.000000  0.236231  0.362754  0.744028  0.940179
1    0.424744  0.689684  0.288855  0.879529  0.887812
2    0.458715  0.345464  0.007214  0.870160  0.529707
3    0.310880  0.694685  0.902469  0.235050  0.888510
4    0.805291  0.692822  0.906795  0.887768  0.585261

In [62]:
newdf.loc[0]["C"]=700

In [63]:
newdf

            A         B           C         D         E
0  321.000000  0.236231  700.000000  0.744028  0.940179
1    0.424744  0.689684    0.288855  0.879529  0.887812
2    0.458715  0.345464    0.007214  0.870160  0.529707
3    0.310880  0.694685    0.902469  0.235050  0.888510
4    0.805291  0.692822    0.906795  0.887768  0.585261

In [76]:
newdf.drop('E',axis=1)

            A         B           C         D
0  700.000000  0.236231  700.000000  0.744028
1    0.424744  0.689684    0.288855  0.879529
2    0.458715  0.345464    0.007214  0.870160
3    0.310880  0.694685    0.902469  0.235050
4    0.805291  0.692822    0.906795  0.887768

In [77]:
newdf

            A         B           C         D         E
0  700.000000  0.236231  700.000000  0.744028  0.940179
1    0.424744  0.689684    0.288855  0.879529  0.887812
2    0.458715  0.345464    0.007214  0.870160  0.529707
3    0.310880  0.694685    0.902469  0.235050  0.888510
4    0.805291  0.692822    0.906795  0.887768  0.585261

In [78]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.288855  0.879529
2  0.007214  0.870160

In [81]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.424744  0.689684  0.288855  0.879529  0.887812
2  0.458715  0.345464  0.007214  0.870160  0.529707

In [85]:
newdf.loc[(newdf["A"]>0.4) & (newdf["C"]>0.1)]

            A         B           C         D         E
0  700.000000  0.236231  700.000000  0.744028  0.940179
1    0.424744  0.689684    0.288855  0.879529  0.887812
4    0.805291  0.692822    0.906795  0.887768  0.585261

In [88]:
newdf.iloc[0,4]

0.940178523050644

In [90]:
newdf.iloc[[0,4],[3,4]]

          D         E
0  0.744028  0.940179
4  0.887768  0.585261

In [94]:
newdf.reset_index(drop=True)

            A         B           C         D         E
0  700.000000  0.236231  700.000000  0.744028  0.940179
1    0.424744  0.689684    0.288855  0.879529  0.887812
2    0.458715  0.345464    0.007214  0.870160  0.529707
3    0.310880  0.694685    0.902469  0.235050  0.888510
4    0.805291  0.692822    0.906795  0.887768  0.585261

In [97]:
newdf.loc[:,['A']]=None

In [98]:
newdf

      A         B           C         D         E
0  None  0.236231  700.000000  0.744028  0.940179
1  None  0.689684    0.288855  0.879529  0.887812
2  None  0.345464    0.007214  0.870160  0.529707
3  None  0.694685    0.902469  0.235050  0.888510
4  None  0.692822    0.906795  0.887768  0.585261

In [99]:
newdf['A'].isnull()

0    True
1    True
2    True
3    True
4    True
Name: A, dtype: bool

In [100]:
newdf.shape

(5, 5)

In [102]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       0 non-null      object
 1   B       5 non-null      float64
 2   C       5 non-null      float64
 3   D       5 non-null      float64
 4   E       5 non-null      float64
dtypes: float64(4), object(1)
memory usage: 360.0+ bytes

In [103]:
newdf.notnull()

       A     B     C     D     E
0  False  True  True  True  True
1  False  True  True  True  True
2  False  True  True  True  True
3  False  True  True  True  True
4  False  True  True  True  True

In [104]:
newdf.mean()

A           NaN
B      0.531777
C    140.421066
D      0.723307
E      0.766294
dtype: object

In [105]:
newdf

      A         B           C         D         E
0  None  0.236231  700.000000  0.744028  0.940179
1  None  0.689684    0.288855  0.879529  0.887812
2  None  0.345464    0.007214  0.870160  0.529707
3  None  0.694685    0.902469  0.235050  0.888510
4  None  0.692822    0.906795  0.887768  0.585261